using System.Collections;
using System.Collections.Generic;
using UnityEngine;

public class TextResources : MonoBehaviour {
    public static string[] xing_random = {"文武之道，一张一弛。课业与出游理应结合。",
    "今日诸生学业均有进步，为师该奖励些什么好呢……","上回与八仙的棋局尚未分胜负……",
    "读万卷书，亦要行万里路。","强本而节用，则天不能贫。","见贤思齐焉，见不贤则内自省也。",
    "博学之，审问之，慎思之，明辨之，笃行之。","问我这句话是什么意思？到我身边来，我同你讲。",
    "年龄、外貌、身份……并非决定谁能成为老师的标准。人皆可为师。"};
    public static string[] xing_dayRandom = {"文武之道，一张一弛。课业与出游理应结合。",
    "今日诸生学业均有进步，为师该奖励些什么好呢……","上回与八仙的棋局尚未分胜负……",
        "读万卷书，亦要行万里路。","强本而节用，则天不能贫。","见贤思齐焉，见不贤则内自省也。",
    "博学之，审问之，慎思之，明辨之，笃行之。","问我这句话是什么意思？到我身边来，我同你讲。",
    "年龄、外貌、身份……并非决定谁能成为老师的标准。人皆可为师。",
    "过来，我考考你，看你是否忘了之前所学？"};
    public static string[] xing_nightRandom = {"文武之道，一张一弛。课业与出游理应结合。",
    "今日诸生学业均有进步，为师该奖励些什么好呢……","上回与八仙的棋局尚未分胜负……",
        "读万卷书，亦要行万里路。","强本而节用，则天不能贫。","见贤思齐焉，见不贤则内自省也。",
    "博学之，审问之，慎思之，明辨之，笃行之。","问我这句话是什么意思？到我身边来，我同你讲。",
    "年龄、外貌、身份……并非决定谁能成为老师的标准。人皆可为师。",
    "夤夜独行，易心生惧意……","入夜了……我今日所教，你可都记住了？谨记，温故知新。"};

    public static string xing_morning = "过来，我考考你，看你是否忘了之前所学？";
    public static string xing_night = "入夜了……我今日所教，你可都记住了？谨记，温故知新。";
    public static string xing_start = "\"业精于勤，荒于嬉。\"是该学习的时候了。";
}
